{
  "personality_traits": {
    "一白水星": {
      "知性": 9,
      "現実主義": 8,
      "洞察力": 7,
      "コミュニケーション力": 8,
      "忍耐力": 6,
      "独創性": 7
    },
    "二黒土星": {
      "思いやり": 9,
      "調和性": 8,
      "忍耐力": 8,
      "協調性": 7,
      "決断力": 5,
      "自己主張": 6
    },
    "三碧木星": {
      "独創性": 9,
      "リーダーシップ": 8,
      "行動力": 8,
      "成長志向": 7,
      "安定性": 5,
      "現実感覚": 6
    },
    "四緑木星": {
      "成長志向": 8,
      "創造性": 9,
      "柔軟性": 7,
      "行動力": 7,
      "計画性": 6,
      "安定性": 5
    },
    "五黄土星": {
      "バランス感覚": 9,
      "使命感": 8,
      "管理能力": 8,
      "責任感": 7,
      "柔軟性": 5,
      "変化対応力": 6
    },
    "六白金星": {
      "正義感": 9,
      "規律性": 8,
      "責任感": 8,
      "判断力": 7,
      "柔軟性": 5,
      "感受性": 6
    },
    "七赤金星": {
      "自信": 9,
      "表現力": 8,
      "決断力": 8,
      "独立心": 7,
      "協調性": 5,
      "粘り強さ": 6
    },
    "八白土星": {
      "安定性": 9,
      "思慮深さ": 8,
      "分析力": 7,
      "忍耐力": 8,
      "冒険心": 5,
      "感情表現": 6
    },
    "九紫火星": {
      "情熱": 9,
      "魅力": 8,
      "社交性": 8,
      "創造性": 7,
      "忍耐力": 5,
      "計画性": 6
    }
  },
  "compatibility": {
    "一白水星": {
      "good": ["六白金星", "八白土星"],
      "bad": ["四緑木星", "九紫火星"]
    },
    "二黒土星": {
      "good": ["三碧木星", "四緑木星"],
      "bad": ["七赤金星", "六白金星"]
    },
    "三碧木星": {
      "good": ["二黒土星", "五黄土星"],
      "bad": ["七赤金星", "一白水星"]
    },
    "四緑木星": {
      "good": ["二黒土星", "五黄土星"],
      "bad": ["九紫火星", "一白水星"]
    },
    "五黄土星": {
      "good": ["三碧木星", "四緑木星"],
      "bad": ["六白金星", "七赤金星"]
    },
    "六白金星": {
      "good": ["一白水星", "九紫火星"],
      "bad": ["二黒土星", "五黄土星"]
    },
    "七赤金星": {
      "good": ["八白土星", "九紫火星"],
      "bad": ["二黒土星", "三碧木星"]
    },
    "八白土星": {
      "good": ["一白水星", "七赤金星"],
      "bad": ["二黒土星", "五黄土星"]
    },
    "九紫火星": {
      "good": ["六白金星", "七赤金星"],
      "bad": ["一白水星", "四緑木星"]
    }
  },
  "yearly_fortune": {
    "一白水星": {
      "1": "今年は新しいプロジェクトを始めるのに最適な時期です。特に知的創造的な仕事に恵まれるでしょう。",
      "2": "人間関係が重要になる年。協力者との絆を深めることで、将来への種まきとなります。",
      "3": "積極的な行動と決断が必要な年。迷いを捨てて前進すると、大きな飛躍が期待できます。",
      "4": "内省と準備の年。目標達成のために必要なスキルや知識を身につける時期です。",
      "5": "変化と成長の年。新しいアイデアや環境を受け入れることで、次のステージへ進む準備が整います。",
      "6": "収穫の年。これまでの努力が実を結び、安定と成功をもたらすでしょう。",
      "7": "挑戦の年。困難や障害が現れますが、それを乗り越えることで大きく成長できます。",
      "8": "安定と充実の年。健康に気を配りながら、これまでの成果を享受しましょう。",
      "9": "終わりと始まりの年。過去の章を閉じ、新しいサイクルへの準備をする時です。"
    },
    "二黒土星": {
      "1": "新しいスタートの年。特に人間関係や家庭面での新たな展開がありそうです。",
      "2": "自分自身と向き合う年。内面的な成長と精神的な安定を得るチャンスです。",
      "3": "行動と拡大の年。特に対人関係やコミュニケーションを通じて成長できるでしょう。",
      "4": "基盤固めの年。地道な努力が将来の安定につながります。",
      "5": "変化と調整の年。新しい環境や状況に柔軟に対応することが重要です。",
      "6": "調和と協力の年。周囲との関係性を大切にすることで、幸運を引き寄せます。",
      "7": "試練と克服の年。困難に直面しても、忍耐強く対応することで道が開けます。",
      "8": "充実と達成の年。努力が報われ、精神的な豊かさも得られるでしょう。",
      "9": "完結と準備の年。一つのサイクルが終わり、次への準備が始まります。"
    },
    "三碧木星": {
      "1": "新たな成長の年。知的好奇心を満たす活動が幸運を引き寄せます。",
      "2": "協力と支援の年。人とのつながりを通じて、新たな可能性が開けるでしょう。",
      "3": "自己表現の年。創造性を発揮し、自分らしさを表現することで成功へ近づきます。",
      "4": "基礎固めの年。将来の飛躍のために、今は着実に力をつける時期です。",
      "5": "転換と発展の年。古い習慣や考え方を手放し、新しい自分へと生まれ変わりましょう。",
      "6": "成果の年。努力が実を結び、多くの人から認められる時期です。",
      "7": "内省と成長の年。困難も多いですが、それらを通じて真の強さを得られます。",
      "8": "安定と繁栄の年。経済面でも精神面でも豊かさを感じられるでしょう。",
      "9": "完成と転換の年。今までの経験を活かし、次のステージへの準備をする時です。"
    },
    "四緑木星": {
      "1": "新しい可能性の年。特に創造的な分野での新たな挑戦が幸運をもたらします。",
      "2": "協調と学びの年。周囲との関係を深めながら、新たなスキルを身につけましょう。",
      "3": "成長と発展の年。自分の才能を信じ、積極的に前進することで道が開けます。",
      "4": "安定と充実の年。今までの努力が実を結び始める時期です。",
      "5": "変革の年。新しい環境や状況に適応することで、より大きな成長が期待できます。",
      "6": "調和と成功の年。人間関係が良好で、仕事も順調に進むでしょう。",
      "7": "試練と忍耐の年。困難に立ち向かう勇気が、将来の成功につながります。",
      "8": "収穫と充実の年。多方面で成果を得られ、満足感を味わえるでしょう。",
      "9": "総括と準備の年。これまでの経験を振り返り、新たなサイクルへの準備をしましょう。"
    },
    "五黄土星": {
      "1": "新たなスタートの年。特に仕事や社会的立場に関わる新しい展開がありそうです。",
      "2": "内省と計画の年。じっくりと将来を見据えた準備をすることが重要です。",
      "3": "拡大と成長の年。新しいことに挑戦する勇気が、大きな成果をもたらします。",
      "4": "安定と堅実の年。地に足をつけた行動が、将来の成功の基盤となります。",
      "5": "中心の年。あなたの真価が問われ、本来の力を発揮できる時期です。",
      "6": "責任と評価の年。リーダーシップを発揮することで、周囲からの信頼を得られます。",
      "7": "挑戦と乗り越えの年。困難も多いですが、それが将来の飛躍につながります。",
      "8": "収穫と成功の年。努力が実を結び、多くの面で満足感を得られるでしょう。",
      "9": "完結と再生の年。一つのサイクルが終わり、新たな可能性へと向かう時です。"
    },
    "六白金星": {
      "1": "新しい道の年。特に精神的・知的な面での新たな挑戦が重要です。",
      "2": "準備と調和の年。人との関わりを大切にしながら、将来への土台を築きましょう。",
      "3": "活動と進展の年。積極的な行動が、予想以上の成果をもたらすでしょう。",
      "4": "基盤固めの年。今は目立たなくても、着実な努力が将来花開きます。",
      "5": "変化と調整の年。環境の変化に柔軟に対応することで、新たな道が開けます。",
      "6": "充実と達成の年。多くの面で成功を収め、周囲からの評価も高まります。",
      "7": "反省と克服の年。困難や障害を乗り越えることで、真の強さを得られます。",
      "8": "安定と発展の年。精神的にも物質的にも豊かさを実感できるでしょう。",
      "9": "完成と移行の年。今までの経験を活かし、新たなステージへ向かう準備をしましょう。"
    },
    "七赤金星": {
      "1": "再出発の年。新しい目標に向かって、エネルギッシュに行動する時です。",
      "2": "協力と支援の年。周囲との関係を深めることで、将来への種をまきましょう。",
      "3": "表現と拡大の年。自分の才能や個性を積極的に表現することが重要です。",
      "4": "整理と準備の年。内面を見つめ直し、次なる飛躍のための力を蓄えましょう。",
      "5": "変革と挑戦の年。新しい環境や状況に果敢に挑むことで、大きく成長できます。",
      "6": "成功と認知の年。努力が実を結び、社会的な評価も高まるでしょう。",
      "7": "自己と向き合う年。内面の声に耳を傾け、真の自分を見つける時です。",
      "8": "充実と繁栄の年。多方面で成果を得られ、充実感を味わえるでしょう。",
      "9": "完結と解放の年。過去のしがらみから解放され、新たな自分へと生まれ変わります。"
    },
    "八白土星": {
      "1": "新たな基盤づくりの年。特に家庭や安定に関わる新しい展開が期待できます。",
      "2": "協調と忍耐の年。周囲との関係を大切にしながら、じっくりと力を蓄えましょう。",
      "3": "前進と行動の年。積極的に行動することで、新たな可能性が広がります。",
      "4": "安定と充実の年。地道な努力が実を結び、精神的な安定も得られるでしょう。",
      "5": "変化と適応の年。環境の変化を受け入れ、柔軟に対応することが重要です。",
      "6": "調和と成長の年。人間関係が良好で、様々な面で成長が期待できます。",
      "7": "内省と乗り越えの年。困難もありますが、それを克服することで強くなれます。",
      "8": "本領発揮の年。あなたの真価が発揮され、多くの成果を上げられるでしょう。",
      "9": "区切りと浄化の年。不要なものを手放し、新たな段階へ向かう準備をする時です。"
    },
    "九紫火星": {
      "1": "新たな情熱の年。新しいことに熱中し、エネルギッシュに行動する時です。",
      "2": "バランスと支援の年。人との関わりを大切にしながら、内面を豊かにしましょう。",
      "3": "拡大と成長の年。積極的に行動し、自分の可能性を広げていく時期です。",
      "4": "安定と蓄積の年。地道な努力が将来の飛躍につながります。",
      "5": "変革と選択の年。重要な決断を迫られることもありますが、それが成長につながります。",
      "6": "成功と実現の年。努力が実を結び、多くの夢や目標が達成されるでしょう。",
      "7": "試練と成長の年。困難に直面しても、それを糧にして強くなれます。",
      "8": "豊かさと繁栄の年。精神的にも物質的にも満たされ、充実感を得られるでしょう。",
      "9": "完成と変革の年。一つのサイクルが完結し、新たな自分へと生まれ変わる時です。"
    }
  }
} 